<img src="http://cognitiveclass.ai/wp-content/uploads/2017/11/cc-logo-square.png" width="150">

<h1 align=center>LISTS and DATAFRAMES in R</h1>


## Table of Contents


<div class="alert alert-block alert-info" style="margin-top: 20px">
<li><a href="#About-the-Dataset">About the Dataset</a></li>
<li><a href="#Lists">Lists</a></li>
<li><a href="#DataFrames">DataFrames</a></li>
<br>
<p></p>
Estimated Time Needed: <strong>15 min</strong>
</div>

<hr>

<a id="ref0"></a>
<center><h2>About the Dataset</h2></center>

Imagine you got many movie recomendations from your friends and compiled all of the recomendations in a table, with specific info about each movie.

The table has one row for each movie and several columns

- **name** - The name of the movie
- **year** - The year the movie was released
- **length_min** - The lenght of the movie in minutes
- **genre** - The genre of the movie
- **average_rating** - Average rating on Imdb
- **cost_millions** - The movie's production cost in millions
- **sequences** - The amount of sequences
- **foreign** - Indicative of whether the movie is foreign (1) or domestic (0)
- **age_restriction** - The age restriction for the movie
<br>
<br>

Part of the dataset can be seen below

<img src = "https://ibm.box.com/shared/static/6kr8sg0n6pc40zd1xn6hjhtvy3k7cmeq.png" align = "center">

<hr>

<a id="ref1"></a>
<center><h2>Lists</h2></center>

First of all, we're gonna take a look at lists in R. A list is a sequenced collection of different objects of R, like vectors, numbers, characters, other lists as well, and so on. You can consider a list as a container of correlated information, well structured and easy to read. A list accepts items of different types, but a vector (or a matrix, which is a multidimensional vector) doesn't. To create a list just type __list()__ with your content inside the parenthesis and separated by commas. Letâ€™s try it!

In [2]:
# NOTE: a list is NOT necessarily "correlated information", but a data frame is "correlated information"
#   However, if a list is a row in a data frame, then it could be "correlated information".
# NOTE: a matrix is not a multidimensional vector (it is a 2 dimensional vector)
movie <- list("Toy Story", 1995, c("Animation", "Adventure", "Comedy"))

In the code above, the variable movie contains a list of 3 objects, which are a string, a numeric value, and a vector of strings. Easy, eh? Now let's print the content of the list. We just need to call its name.

In [3]:
movie

[[1]]
[1] "Toy Story"

[[2]]
[1] 1995

[[3]]
[1] "Animation" "Adventure" "Comedy"

A list has a sequence and each element of a list has a position in that sequence, which starts from 1. If you look at our previous example, you can see that each element has its position represented by double square brackets "**[[ ]]**".

### Accessing items in a list
It is possible to retrieve only a part of a list using the **single _square** bracket operator_ "**[ ]**". This operator can be also used to get a single element in a specific position. Take a look at the next example:

The index number 2 returns the second element of a list, if that element exists:

In [4]:
movie[2]

[[1]]
[1] 1995

Or you can select a part or interval of elements of a list. In our next example we are retrieving the 1st, 2nd, and 3rd elements:

In [5]:
movie[2:3]   # NOTE: this is NOT retrieving the 1st, 2nd, and 3rd elements. It is retrieving only the 2nd and 3rd elements.

[[1]]
[1] 1995

[[2]]
[1] "Animation" "Adventure" "Comedy"

It looks a little confusing, but lists can also store names for its elements.

### Named lists

The following list is a named list:

In [6]:
# We can assign names to the items in a list
movie <- list(name = "Toy Story",
             year = 1995,
             genre = c("Animation", "Adventure", "Comedy"))

Let me explain that: the list **movie** has some named objects within it. **name**, for example, is an object of type **character**, **year** is an object of type **number**, and **genre** is a vector with objects of type **character**.


Now take a look at this list. This time, it's full of information and well organized. It's clear what each element means. You can see that the elements have different types, and that's ok because it's a list.

In [7]:
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

You can also get separated information from the list. You can use **listName\$selectorName**. The _dollar-sign operator_ **$** will give you the block of data that is related to selectorName.

Let's get the genre part of our movies list, for example.

In [8]:
movie$genre

[1] "Animation" "Adventure" "Comedy"

Another way of selecting the genre column:

In [9]:
movie["genre"]

$genre
[1] "Animation" "Adventure" "Comedy"

You can also use numerical selectors like an array. Here we are selecting elements from 2 to 3.

In [10]:
movie[2:3]

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

The function __class()__ returns the type of a object. You can use that function to retrieve the type of specific elements of a list:

In [11]:
class(movie$name)
class(movie$foreign)    # since the "movie" list does not have an object named "foreign", the class is "NULL"

[1] "character"

[1] "NULL"

### Adding, modifying, and removing items

Adding a new element is also very easy. The code below adds a new field named **age** and puts the numerical value 0 into it. In this case we use the double square brackets operator, because we are directly referencing a list member (and we want to change its content).

In [12]:
movie[["age"]] <- 5
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

$age
[1] 5

In order to modify, you just need to reference a list member that already exists, then change its content.

In [13]:
movie[["age"]] <- 6
# Now it's 6, not 5
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

$age
[1] 6

And removing is also easy! You just put **_NULL_**, which means missing value/data, into it.

In [14]:
movie[["age"]] <- NULL
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

### Concatenating lists

Concatenation is the proccess of puting things together, in sequence. And yes, you can do it with lists. Just call the function **_c()_**. Take a look at the next example:

In [15]:
# We split our previous list in two sublists
movie_part1 <- list(name = "Toy Story")
movie_part2 <- list(year = 1995, genre = c("Animation", "Adventure", "Comedy"))

# Now we call the function c() to put everything together again
# NOTE: the "c" function is the combine function, but it can also be used for concatenating
movie_concatenated <- c(movie_part1, movie_part2)

# Check it out
movie_concatenated

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

Lists are really handy for organizing different types of elements in R, and also easy to use. Additionally, lists are also important since this type of data structure is essential to create data frames, our next covered topic.

NOTE: The list above contains a vector of multiple genre values per movie.  This does not fit with the data frame structure.

<hr>

<a id="ref2"></a>
<center><h2>DataFrames</h2></center>

A DataFrame is a structure that is used for storing data tables. Underneath it all, a data frame is a list of vectors of same length, exactly like a table (each vector is a column). We call a function called  __data.frame()__ to create a data frame and pass vector, which are our columns, as arguments. It is required to name the columns that will compose the data frame.

In [16]:
movies <- data.frame(name = c("Toy Story", "Akira", "The Breakfast Club", "The Artist",
                              "Modern Times", "Fight Club", "City of God", "The Untouchables"),
                    year = c(1995, 1998, 1985, 2011, 1936, 1999, 2002, 1987),
                    stringsAsFactors=F)

Let's print its content of our recently created data frame:

In [17]:
movies

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

It's very easy! You can note how it looks like a table.

We can also use the __"$"__ selector to get some type of information. This operator returns the content of a specific column of a data frame (that's why we have to choose a name for each column).

In [18]:
movies$name

[1] "Toy Story"          "Akira"              "The Breakfast Club"
[4] "The Artist"         "Modern Times"       "Fight Club"
[7] "City of God"        "The Untouchables"

You retrieve data using numeric indexing, like in lists:

In [19]:
# This returns the first (1st) column
movies[1]

  name
1 Toy Story
2 Akira
3 The Breakfast Club
4 The Artist
5 Modern Times
6 Fight Club
7 City of God
8 The Untouchables

The function called __str()__ is one of most useful functions in R. With this function you can obtain textual information about an object. In this case,  it delivers information about the objects whitin a data frame. Let's see what it returns:

In [20]:
# The structure function str() return the structure of the data frame
str(movies)

'data.frame':	8 obs. of  2 variables:
 $ name: chr  "Toy Story" "Akira" "The Breakfast Club" "The Artist" ...
 $ year: num  1995 1998 1985 2011 1936 ...

It shouws this data frame has 8 observations, for 2 columns, so called __name__ and __year__. The "name" column is a factor with 8 levels and "year" is a numerical column.

The class() function works for data frames as well. You can use it to determine the type of a column of a data frame.

In [21]:
class(movies$year)

[1] "numeric"

You can use numerical selectors to reach information inside the table.

In [22]:
# this uses the index values to select row 1 column 2 (row 1 column 1 is "Toy Story")
movies[1,2] #1-Toy Story, 2-1995

[1] 1995

The **_head()_** function is very useful when you have a large table and you need to take a peek at the first elements. This function returns the first 6 values of a data frame (or event a list).

In [23]:
head(movies)

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999

Similar to the previous function, **_tail()_** returns the last 6 values of a data frame or list.

In [24]:
tail(movies)

  name               year
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

Now let's try to add a new column to our data frame with the length of each movie in minutes.

In [25]:
movies['length'] <- c(81, 125, 97, 100, 87, 139, 130, 119)
movies

  name               year length
1 Toy Story          1995  81
2 Akira              1998 125
3 The Breakfast Club 1985  97
4 The Artist         2011 100
5 Modern Times       1936  87
6 Fight Club         1999 139
7 City of God        2002 130
8 The Untouchables   1987 119

A new column was included into our data frame with just one line of code. We just needed to add a vector to data frame, then it will be our new column.

Now let's try to add a new movie to our data set.

In [26]:
movies <- rbind(movies, c(name="Dr. Strangelove", year=1964, length=94))
movies

  name               year length
1 Toy Story          1995 81
2 Akira              1998 125
3 The Breakfast Club 1985 97
4 The Artist         2011 100
5 Modern Times       1936 87
6 Fight Club         1999 139
7 City of God        2002 130
8 The Untouchables   1987 119
9 Dr. Strangelove    1964 94

Remember, you can't add a list with more variables than the data frame, and vice-versa.

We don't need this movie anymore, so let's delete it. Here we are deleting row 12 by assigning to itself the movies dataframe without the 12th row.

In [28]:
# movies <- movies[-12,]    # NOTE: We do NOT have 12 rows, we only have 9 rows
movies <- movies[-9,]       # use this line to delete the last row (Dr. Strangelove)
movies

  name               year length
1 Toy Story          1995 81
2 Akira              1998 125
3 The Breakfast Club 1985 97
4 The Artist         2011 100
5 Modern Times       1936 87
6 Fight Club         1999 139
7 City of God        2002 130
8 The Untouchables   1987 119

To delete a column you can just set it as **_NULL_**.

In [29]:
movies[["length"]] <- NULL
movies

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

That is it! You learned a lot about data frames and how easy it is to work with them.

<hr>

#### Scaling R with big data

As you learn more about R, if you are interested in exploring platforms that can help you run analyses at scale, you might want to sign up for a free account on [IBM Watson Studio](http://cocl.us/dsx_rp0101en), which allows you to run analyses in R with two Spark executors for free.

---

#### About the Author:  
Hi! It's [Thiago Felipe Correa Borges](https://www.linkedin.com/in/thiago-felipe-corr%C3%AAa-borges-a932bb114?trk=nav_responsive_tab_profile), the author of this notebook. I hope you found R easy to learn! There's lots more to learn about R but you're well on your way. Feel free to connect with me if you have any questions.

<hr>


Copyright &copy; [IBM Cognitive Class](https://cognitiveclass.ai). This notebook and its source code are released under the terms of the [MIT License](https://cognitiveclass.ai/mit-license/).